# -*- coding: utf-8 -*-
"""
Created on Wed Jan 31 17:20:26 2018
正则表达式处理中文
@author: Administrator
"""
import re  
#==============================================================================
# 正则表达式入门-1
#==============================================================================
key = r"<html><body><h1>hello world<h1></body></html>" # 这是要匹配的文本
p1 = r"(?<=<h1>).+?(?=<h1>)" # 这是我们写的正则表达式规则，你现在可以不理解啥意思
pattern1 = re.compile(p1) # 我们在编译这段正则表达式
matcher1 = re.search(pattern1,key) # 在源文本中搜索符合正则表达式的部分
if matcher1: # 如果匹配成功
    print(matcher1.group(0)) # 打印出来

#==============================================================================
# 正则表达式入门-2
#==============================================================================
key = r"javapythonhtmlvhdl" # 这是源文本
p1 = r"python" # 这是我们写的正则表达式
pattern1 = re.compile(p1) # 编译
matcher1 = re.search(pattern1,key) # 是查询
if matcher1: # 如果匹配成功
    print(matcher1.group(0)) #打印出来

#==============================================================================
#  贪婪与懒惰
#==============================================================================
key = r"chuxiuhong@hit.edu.cn"
p1 = r"@.+\."#我想匹配到@后面一直到“.”之间的，在这里是hit
pattern1 = re.compile(p1)
print pattern1.findall(key)
# 输出结果:['@hit.edu.'] 咋多了呢？我理想的结果是@hit.，你咋还给我加量了呢？
# 正则表达式默认是“贪婪”的,'+'代表是字符重复一次或多次,所以它会尽可能“贪婪”地多给我们匹配字符

# 我们怎么解决这种问题呢？让他变成懒惰模式，只要在“+”后面加一个“？”就好了
key = r"chuxiuhong@hit.edu.cn"
p1 = r"@.+?\."#我想匹配到@后面一直到“.”之间的，在这里是hit
pattern1 = re.compile(p1)
print pattern1.findall(key)
# 输出结果 ['@hit.']

#==============================================================================
# 正则表达式  
#==============================================================================

